{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing components, features, and data structures for the GTA Online Horse Track Guesser app.",
  "frontend/DEPLOYMENT.md": "Deployment guide documentation outlining pre-deployment checklist and build verification steps for deploying to Internet Computer.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using HSL values.",
  "frontend/index.html": "HTML entry point with PWA manifest, app icons, theme color, and viewport meta tags for the Horse Track Guesser app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, display mode, and theme colors for standalone mobile installation.",
  "frontend/src/App.tsx": "Main app component with five-tab navigation (Info, Dashboard, New Entry, Stats, History) using useOnDeviceMemory hook and null-safety checks for learnedState.",
  "frontend/src/components/AppHeader.tsx": "Sticky header component displaying app icon and title with custom subtitle in a mobile-optimized container.",
  "frontend/src/components/MobilePageContainer.tsx": "Layout wrapper component enforcing max-width and consistent horizontal padding for mobile-first design.",
  "frontend/src/components/SkipToContent.tsx": "Accessibility component providing keyboard users a skip-to-main-content link with focus styling.",
  "frontend/src/components/StatusEmoji.tsx": "Accessible emoji component with aria-label and screen reader support for status indicators.",
  "frontend/src/features/analytics/StatsAnalyticsView.tsx": "Analytics view displaying learning weights (odds, win rate, form, streaks) with progress bars and contender statistics.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Dashboard view showing race prediction performance metrics including total races, accuracy, ROI, model mood, and strategy breakdown with visual indicators.",
  "frontend/src/features/dashboard/InfoDashboardView.tsx": "Displays a comprehensive performance dashboard with metrics including total races, prediction accuracy, ROI, model mood, recent performance trends, and betting statistics. Includes a reset button for clearing app memory.",
  "frontend/src/features/entries/EntryFlow.tsx": "Multi-step form component for entering race data: collecting odds for 6 contenders, generating predictions using the learning model, recording actual results, and optionally entering bet amounts. Handles validation and state management across all steps.",
  "frontend/src/features/entries/types.ts": "Defines TypeScript types for race entries including Contender, RaceEntry, BetDetails, OddsData, StrategyProfile, and ContenderStats. Core data structures for the race prediction system.",
  "frontend/src/features/entries/validation.ts": "Provides validation functions for odds, winners, contenders, and podium positions. Returns ValidationResult objects with success status and error messages.",
  "frontend/src/features/help/AndroidApkHelp.tsx": "Empty file with no content.",
  "frontend/src/features/history/HistoryList.tsx": "Displays a chronologically sorted list of past race entries showing predicted vs actual winners, confidence levels, podium finishes, and timestamps. Shows empty state when no history exists.",
  "frontend/src/features/learning/accuracyVisuals.ts": "Provides helper functions to map accuracy percentages, ROI, calibration scores, and model mood to visual indicators (colors, emojis, and labels) for UI display.",
  "frontend/src/features/learning/LearningSummaryCard.tsx": "Card component showing learning model status including overall accuracy, training data size, and visual indicators. Displays empty state prompting users to enter race data when no training data exists.",
  "frontend/src/features/learning/metrics.ts": "Calculates learning metrics from race entries including accuracy, ROI, Brier score, strategy-specific ROI, model mood based on recent performance, and RNG tilt detection.",
  "frontend/src/features/learning/model.ts": "Implements the prediction model that calculates winner probabilities using weighted signals (odds, win rate, recent form, streaks) with learned weights and strategy profiles, including hot streak detection and signal agreement scoring.",
  "frontend/src/features/reset/ResetAppMemoryButton.tsx": "React component that renders a destructive button with confirmation dialog to reset all app memory including race entries and learned prediction data.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, identity persistence, and providing authentication status throughout the app.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm terracotta color palette for light and dark themes, plus base styles for accessibility and typography.",
  "frontend/src/lib/betSizing.ts": "Implements Kelly Criterion-based bet sizing with 25% fractional Kelly, adjusting for edge, signal agreement, and skip-race conditions. Returns bet amount (rounded to nearest 100, capped at $10k) and explanation string.",
  "frontend/src/lib/oddsFormat.ts": "Provides utilities for formatting, parsing, and converting odds between fractional (e.g., \"5/1\") and decimal formats, plus calculating implied probability from OddsData or numeric odds.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider, then mounts to the root DOM element.",
  "frontend/src/storage/localMemoryStore.ts": "Defines LearnedState interface and calculateLearnedState function that aggregates contender statistics (wins, streaks, recent form, momentum) from race entries, updating signal weights and variance data over time.",
  "frontend/src/storage/storageKeys.ts": "Exports storage version constant and keys for persisting race entries, learned state, and contenders cache in browser storage.",
  "frontend/src/storage/useOnDeviceMemory.ts": "React hook that manages on-device persistence of race entries and learned state, providing methods to add entries, recompute state, clear memory, and set strategy profile.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (using oklch), container settings, border radius variables, typography, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata documenting architectural decisions, known issues, and feature requirements, emphasizing fractional odds storage, on-device persistence, adaptive learning, and mobile-first design."
}