{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: adding '0' placeholder text to odds numerator input and positioning a non-editable '/1' label next to odds inputs in EntryFlow.tsx.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, features, storage, and utilities with details on odds formatting, streak tracking, signal breakdown, and learning model implementation.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining pre-deployment checklist and build verification steps for deploying the frontend to Internet Computer.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes including color tokens for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with PWA manifest, app icons, theme color, and viewport configuration for the GTA Online Horse Track Guesser application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, display mode, and theme colors for standalone mobile installation.",
  "frontend/src/App.tsx": "Main application component with four-tab navigation (Dashboard, New Entry, Stats, History), integrating on-device memory management and handling loading/error states with null-safety checks for learnedState.",
  "frontend/src/components/AppHeader.tsx": "Sticky header component displaying app icon, title 'GTA Online Horse Track Guesser', and custom subtitle with mobile-optimized layout.",
  "frontend/src/components/MobilePageContainer.tsx": "Layout wrapper component enforcing mobile-first max-width (2xl) and consistent horizontal padding for page content.",
  "frontend/src/components/SkipToContent.tsx": "Accessibility component providing keyboard users a visually-hidden skip-to-main-content link with focus styling.",
  "frontend/src/components/StatusEmoji.tsx": "Accessible emoji component with aria-label, title, and screen-reader-only text for status indicators.",
  "frontend/src/features/analytics/StatsAnalyticsView.tsx": "Statistics view displaying learning weights (odds, win rate, recent form, streak) with progress bars, log-loss metrics, and contender performance data.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Dashboard view showing total races, prediction accuracy, ROI, model mood, recent race history, strategy performance breakdown, and reset functionality with visual indicators and progress metrics.",
  "frontend/src/features/entries/EntryFlow.tsx": "Multi-step wizard component for entering race data: collects odds for 6 contenders, generates predictions using the learned model, records actual results, and handles bet sizing with strategy profiles.",
  "frontend/src/features/entries/types.ts": "TypeScript type definitions for race entries, contenders, odds data, bet details, and strategy profiles used throughout the application.",
  "frontend/src/features/entries/validation.ts": "Validation functions for odds, winner selection, contenders, and podium positions with detailed error messages.",
  "frontend/src/features/help/AndroidApkHelp.tsx": "Empty file, likely a placeholder for Android APK help documentation component.",
  "frontend/src/features/history/HistoryList.tsx": "Displays a chronologically sorted list of past race entries showing predictions, actual winners, confidence levels, and podium finishes with correctness badges.",
  "frontend/src/features/learning/accuracyVisuals.ts": "Utility functions that map accuracy percentages, ROI, calibration scores, and model mood states to visual indicators (colors, emojis, labels) for UI display.",
  "frontend/src/features/learning/LearningSummaryCard.tsx": "Dashboard card component displaying learning metrics including overall accuracy, recent performance, ROI, and total races with visual progress indicators and emojis.",
  "frontend/src/features/learning/metrics.ts": "Defines metrics calculation functions for race predictions including accuracy, ROI, Brier score, and strategy-specific performance. Also includes model mood and RNG tilt status calculations based on recent prediction performance.",
  "frontend/src/features/learning/model.ts": "Implements the prediction model with multiple strategy profiles (Safe, Value, Balanced, Aggressive) that compute weighted scores from various signals (odds, win rate, form, streaks) to predict race winners and calculate confidence levels.",
  "frontend/src/features/reset/ResetAppMemoryButton.tsx": "React component that renders a confirmation dialog button to reset all app memory including race entries and learned prediction data.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm terracotta color palette for light and dark themes, plus base styling for accessibility and focus states.",
  "frontend/src/lib/betSizing.ts": "Implements Kelly Criterion-based bet sizing with fractional Kelly (25%) and adjustments for signal agreement, edge detection, and bankroll management with configurable caps.",
  "frontend/src/lib/oddsFormat.ts": "Utility functions for parsing, formatting, and converting between fractional and decimal odds formats, plus calculating implied probabilities from odds data.",
  "frontend/src/lib/utils.ts": "Utility function `cn` that merges Tailwind CSS classes using clsx and tailwind-merge for conditional styling.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/storage/localMemoryStore.ts": "Manages on-device storage for race entries, contender statistics, learned prediction state, and adaptive model weights using localStorage. Includes migration logic for legacy data formats and functions to compute/update learned state from historical race outcomes.",
  "frontend/src/storage/storageKeys.ts": "Defines storage version (5.0) and localStorage key constants for entries, learned state, and contenders cache.",
  "frontend/src/storage/useOnDeviceMemory.ts": "React hook that provides state management and CRUD operations for race entries and learned prediction state, with automatic persistence to localStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme tokens for UI components, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata documenting architectural decisions for odds storage (fractional with numerator/denominator), prediction model requirements (log-loss driven, blended lifetime/recent stats), and feature tracking for the race prediction app."
}