{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature-evidence report mapping features to involved files, components, and tests.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose of each frontend file.",
  "frontend/DEPLOYMENT.md": "Partial deployment guide outlining build checks for deploying the frontend to IC.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and light/dark mode styles.",
  "frontend/index.html": "HTML entry point setting up root element, icons, manifest, and main script.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, and icons.",
  "frontend/src/App.tsx": "Main React app wiring tabs for entry, stats, and history views with learned-state updates.",
  "frontend/src/components/AppHeader.tsx": "Header component with app icon, title, and subtitle.",
  "frontend/src/components/MobilePageContainer.tsx": "Wrapper enforcing mobile-first max-width layout.",
  "frontend/src/components/SkipToContent.tsx": "Accessibility link enabling keyboard users to jump to main content.",
  "frontend/src/features/analytics/StatsAnalyticsView.tsx": "Stats view computing and displaying performance metrics, ROI, and calibration.",
  "frontend/src/features/entries/EntryFlow.tsx": "Main component for entering race odds, generating predictions, validating inputs, and saving race entries with optional bet details.",
  "frontend/src/features/entries/types.ts": "Defines TypeScript interfaces for race entries, contenders, bet details, and form data.",
  "frontend/src/features/entries/validation.ts": "Provides validation functions for contenders, winner selection, podium finish order, and margin inputs.",
  "frontend/src/features/help/AndroidApkHelp.tsx": "Empty placeholder file for Android APK help content.",
  "frontend/src/features/history/HistoryList.tsx": "Renders a sorted list of past race entries showing prediction accuracy, bet outcomes, and race details.",
  "frontend/src/features/learning/accuracyVisuals.ts": "Maps accuracy percentages to corresponding color and emoji indicators.",
  "frontend/src/features/learning/LearningSummaryCard.tsx": "Displays learning metrics including accuracy, ROI, and training status using visual indicators.",
  "frontend/src/features/learning/metrics.ts": "Calculates performance metrics such as accuracy, ROI, Brier score, and strategy-based ROI from race entries.",
  "frontend/src/features/learning/model.ts": "Implements prediction logic combining weighted signals, generating implied probabilities, confidence, and winner selection.",
  "frontend/src/features/reset/ResetAppMemoryButton.tsx": "React button component that shows a confirmation dialog and triggers a full reset of stored app data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and logic for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/index.css": "Defines global Tailwind styles and a custom color palette for light/dark themes with improved accessibility.",
  "frontend/src/lib/betSizing.ts": "Calculates a suggested bet amount using a simplified Kelly-based edge and confidence model with explanatory text.",
  "frontend/src/lib/oddsFormat.ts": "Utility functions for formatting numeric odds into fractional string representations.",
  "frontend/src/lib/utils.ts": "Utility wrapper combining clsx and tailwind-merge for safer className merging.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/storage/localMemoryStore.ts": "Manages loading, saving, and defaulting of race entries and learned prediction state in localStorage.",
  "frontend/src/storage/storageKeys.ts": "Defines version and key constants used for storing entries and learned state in localStorage.",
  "frontend/src/storage/useOnDeviceMemory.ts": "React hook that loads, saves, and clears on-device entries and learned state, and recomputes learned state whenever entries change.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current architecture, goals, constraints, known issues, and existing feature records for the prediction app."
}