{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend for the Internet Computer deployment.",
  "feature_evidence.json": "Feature evidence report documenting the removal of the Dashboard tab from App.tsx navigation with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, features, storage, and utilities with details on streak tracking, prediction models, and UI components.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining pre-deployment checklist and build verification steps for deploying the frontend to the Internet Computer.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point with PWA manifest, app icons, theme color, and viewport configuration for the GTA Online Horse Track Guesser application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, display mode, and theme colors for standalone mobile installation.",
  "frontend/src/App.tsx": "Main app component with four-tab navigation (Info, New Entry, Stats, History) using useOnDeviceMemory hook for state management and null-safety checks for learnedState.",
  "frontend/src/components/AppHeader.tsx": "Sticky header component displaying app icon and title with subtitle, wrapped in MobilePageContainer for consistent layout.",
  "frontend/src/components/MobilePageContainer.tsx": "Layout wrapper component enforcing mobile-first max-width (2xl) and responsive horizontal padding.",
  "frontend/src/components/SkipToContent.tsx": "Accessibility component providing keyboard users a skip-to-main-content link with focus styling and screen reader support.",
  "frontend/src/components/StatusEmoji.tsx": "Accessible emoji component with aria-label, title, and visually-hidden text for screen reader compatibility.",
  "frontend/src/features/analytics/StatsAnalyticsView.tsx": "Analytics view displaying learning weights (odds, win rate, form, streaks) with progress bars and contender statistics using gradient descent optimization.",
  "frontend/src/features/dashboard/DashboardView.tsx": "Dashboard view showing race prediction performance metrics including total races, accuracy, ROI, model mood, strategy performance breakdown, and recent race history.",
  "frontend/src/features/dashboard/InfoDashboardView.tsx": "Displays a comprehensive performance dashboard with metrics including total races, prediction accuracy, ROI, model mood, recent performance, and betting statistics. Includes a reset button for clearing app memory.",
  "frontend/src/features/entries/EntryFlow.tsx": "Multi-step form component for entering race data: collecting odds for 6 contenders, generating predictions, recording actual results, and logging bet amounts. Handles validation and state management across the workflow.",
  "frontend/src/features/entries/types.ts": "TypeScript type definitions for race entries, including Contender, RaceEntry, BetDetails, StrategyProfile, and ContenderStats interfaces used throughout the application.",
  "frontend/src/features/entries/validation.ts": "Validation functions for race entry data including odds format, winner selection, contender count, and podium positions. Returns ValidationResult objects with error messages.",
  "frontend/src/features/help/AndroidApkHelp.tsx": "Empty component file with no content.",
  "frontend/src/features/history/HistoryList.tsx": "Displays a chronologically sorted list of past race entries showing predicted vs actual winners, confidence levels, podium finishes, and timestamps with success/failure badges.",
  "frontend/src/features/learning/accuracyVisuals.ts": "Provides helper functions to map accuracy percentages and other metrics (ROI, calibration, model mood) to visual indicators including colors, emojis, and accessibility labels.",
  "frontend/src/features/learning/LearningSummaryCard.tsx": "Card component showing learning model status including overall accuracy with visual indicators, trained race count, and progress metrics. Shows empty state when no data exists.",
  "frontend/src/features/learning/metrics.ts": "Calculates learning metrics from race entries including accuracy, ROI, Brier score, strategy-specific ROI, model mood based on recent performance, and RNG tilt detection.",
  "frontend/src/features/learning/model.ts": "Implements the prediction model that calculates winner probabilities using weighted signals (odds, win rate, recent form, streaks) with learned weights and strategy profiles, including hot streak detection and signal agreement scoring.",
  "frontend/src/features/reset/ResetAppMemoryButton.tsx": "React component that renders a destructive button with confirmation dialog to reset all app memory including race entries and learned prediction data.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/index.css": "Global CSS with Tailwind directives defining a warm terracotta color palette for light and dark modes using CSS custom properties, plus base styling for accessibility and touch interactions.",
  "frontend/src/lib/betSizing.ts": "Calculates recommended bet sizes using fractional Kelly Criterion (25%) based on edge, confidence, implied probability, and signal agreement, with bounds of $0–$10,000 and rounding to nearest $100.",
  "frontend/src/lib/oddsFormat.ts": "Provides utilities to format, parse, and convert odds between fractional (e.g., \"5/1\") and decimal representations, and calculates implied probability from odds.",
  "frontend/src/lib/utils.ts": "Exports a single utility function `cn` that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/storage/localMemoryStore.ts": "Manages learned state (contender stats, signal weights, accuracy metrics) by calculating and aggregating historical race data with momentum scoring and streak tracking.",
  "frontend/src/storage/storageKeys.ts": "Defines storage version and key constants for persisting race entries, learned state, and contender cache in browser storage.",
  "frontend/src/storage/useOnDeviceMemory.ts": "React hook that loads/saves race entries and learned state from local storage, provides methods to add entries, recompute state, clear memory, and update strategy.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette using OKLCH, extended theme tokens for shadcn/ui components, and animation keyframes for accordions.",
  "project_state.json": "Project metadata documenting architectural decisions, known requirements (odds storage with numerator/denominator, edge-based bet sizing, log-loss model updates, session windowing), and feature tracking."
}