{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update odds input to fractional format with /1 denominator and 0 placeholder",
  "requirements": [
    {
      "id": "REQ-70",
      "summary": "Update the odds numerator input field placeholder to display '0' when empty",
      "acceptanceCriteria": [
        "The odds numerator input field shows '0' as placeholder text when empty",
        "No other placeholder text (e.g., 'e.g., 5.0' or '-/1') is displayed in the input field",
        "The placeholder disappears when the user begins typing"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/entries/EntryFlow.tsx",
          "operation": "modify",
          "description": "Update the odds numerator input field placeholder attribute to display '0' instead of any existing placeholder text. Locate the input element for odds numerator (likely in the contender odds entry section) and set its placeholder prop to '0'. Ensure the placeholder styling maintains consistency with existing input fields and follows mobile-first responsive design principles."
        }
      ]
    },
    {
      "id": "REQ-71",
      "summary": "Add non-editable '/1' label adjacent to each odds numerator input field",
      "acceptanceCriteria": [
        "A non-editable '/1' label is rendered immediately adjacent to the right side of each odds numerator input field",
        "The '/1' label is consistently positioned across all 6 contender rows",
        "The label uses the same visual styling (font size, color, alignment) as the existing odds display pattern to maintain consistency"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/entries/EntryFlow.tsx",
          "operation": "modify",
          "description": "Add a non-editable '/1' text label immediately to the right of each odds numerator input field. Wrap the input and label in a flex container to ensure consistent horizontal alignment. Apply styling that matches the existing odds display pattern (font size, color, vertical alignment) and maintains mobile-first responsive design with touch-friendly spacing. Ensure the '/1' label is present for all 6 contender rows in the odds entry step."
        }
      ]
    }
  ]
}